using System;

namespace Markdown
{
    public class Program
    {
        public static void Main()
        {
            var text =
                @"# Спецификация языка разметки

Посмотрите этот файл в сыром виде. Сравните с тем, что показывает github.
Все совпадения случайны ;)



# Курсив

Текст, _окруженный с двух сторон_ одинарными символами подчерка,
должен помещаться в HTML-тег \<em> вот так:

Текст, \<em>окруженный с двух сторон\</em> одинарными символами подчерка,
должен помещаться в HTML-тег \<em>.



# Полужирный

__Выделенный двумя символами текст__ должен становиться полужирным с помощью тега \<strong>.";
            Console.WriteLine(Md.TranslateToHtml(text));
        }
    }
}