<h1>Спецификация языка разметки</h1>

Посмотрите этот файл в сыром виде. Сравните с тем, что показывает github.
Все совпадения случайны ;)



<h1>Курсив</h1>

Текст, <em>окруженный с двух сторон</em> одинарными символами подчерка,
должен помещаться в HTML-тег \<em> вот так:

Текст, \<em>окруженный с двух сторон\</em> одинарными символами подчерка,
должен помещаться в HTML-тег \<em>.



<h1>Полужирный</h1>

<strong>Выделенный двумя символами текст</strong> должен становиться полужирным с помощью тега \<strong>.



<h1>Экранирование</h1>

Любой символ можно экранировать, чтобы он не считался частью разметки.
_Вот это_, не должно выделиться тегом \<em>.

Символ экранирования исчезает из результата, только если экранирует что-то.
Здесь сим\волы экранирования\ \должны остаться.\

Символ экранирования тоже можно экранировать: \<em>вот это будет выделено тегом</em> \<em>



<h1>Взаимодействие тегов</h1>

Внутри <strong>двойного выделения <em>одинарное</em> тоже</strong> работает.

Но не наоборот — внутри <em>одинарного __двойное__ не</em> работает.

Подчерки внутри текста c цифрами_12_3 не считаются выделением и должны оставаться символами подчерка.

Однако выделять часть слова они могут: и в <em>нач</em>але, и в сер<em>еди</em>не, и в кон<em>це.</em>

В то же время выделение в ра_зных сл_овах не работает.

__Непарные_ символы в рамках одного абзаца не считаются выделением.

За подчерками, начинающими выделение, должен следовать непробельный символ. Иначе эти_ подчерки_ не считаются выделением
и остаются просто символами подчерка.

Подчерки, заканчивающие выделение, должны следовать за непробельным символом. Иначе эти _подчерки <em>не считаются</em> окончанием выделения
и остаются просто символами подчерка.

В случае __пересечения _двойных__ и одинарных_ подчерков ни один из них не считается выделением.

Если внутри подчерков пустая строка ____, то они остаются символами подчерка.



<h1>Заголовки</h1>

Абзац, начинающийся с "# ", выделяется тегом \<h1> в заголовок.
В тексте заголовка могут присутствовать все прочие символы разметки с указанными правилами.

Таким образом

<h1>Заголовок <strong>с <em>разными</em> символами</strong></h1>

превратится в:

\<h1>Заголовок \<strong>с \<em>разными\</em> символами\</strong>\</h1>



<h1>Ссылки</h1>

Текст, окруженный открывающей и закрывающей квадратными скобками является текстом в которую будет вставлена ссылка.
Текст, окруженный открывающей и закрывающей круглыми скобками является самой ссылкой.
В итоге текст ссылки оборачивается в тег \<a> c атрибутом href, где указана сама ссылка.
Внутри тега текста ссылки теги курсива и полужирного работают, внутри тега ссылки никакой символ не может являться тегом.
В итоге получается <a href="https://github.com">Ссылка</a> -> \<a href="https://github.com">Ссылка\</a>